In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {
    "customer_id": [1,2,3,4,5,6],
    "name": ['Ella', 'David', 'Zachary', 'Alice', 'Finn', 'Violet'],
    "email": ['emily@example.com', 'michael@example.com', 'sarah@example.com', 'john@example.com', 'john@example.com', 'alice@example.com']
}

In [5]:
duplicate = pd.DataFrame(data)

In [6]:
duplicate

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [7]:
duplicate.drop_duplicates()

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
4            5     Finn     john@example.com
5            6   Violet    alice@example.com

In [21]:
duplicate = duplicate.drop_duplicates(subset=['email'])

In [22]:
duplicate

   customer_id     name                email
0            1     Ella    emily@example.com
1            2    David  michael@example.com
2            3  Zachary    sarah@example.com
3            4    Alice     john@example.com
5            6   Violet    alice@example.com